[
    {
        "version": "2.0.1",
        "date": "2025-02-25",
        "changes": [
            "Rearrange datatable buttons to improve UX",
            "Use recents datasets as on landing page",
            "Fixed unnecessary gray background for created datasets",
            "Add dataset view analytics",
            "Add first time tour",
            "Validate fields for collections",
            "Added dataset published status"
        ]
    },
    {
        "version": "2.0.0",
        "date": "2025-02-17",
        "changes": [
            "Add partners section on landing page",
            "Fixed various linter errors.",
            "Updated the changelog with recent changes.",
            "Restricted schema inference and improved file type validation for document imports.",
            "Added proper loading states to the application.",
            "Switched to `papaparse` for better CSV parsing.",
            "Added CSV downloading support for datasets.",
            "Fixed layout issues on the landing page footer.",
            "Improved data handling performance in data tables.",
            "Added support for multiple databases in the database manager.",
            "Fixed pagination display issues in tables.",
            "Fixed issues with dataset filtering.",
            "Implemented toasts for feedback messages.",
            "Improved dataset fetching for published datasets only.",
            "Fixed an issue with creating new collections.",
            "Added support for importing data into the database manager.",
            "Improved the appearance of modified table cells.",
            "Highlighted edited cells in the data table.",
            "Added support for dropping databases.",
            "Enabled editing database names.",
            "Fixed issues with creating new databases.",
            "Improved UI for the database manager.",
            "Fixed an issue where dataset metadata was undefined.",
            "Fixed layout alignment issues in the footer and navbar.",
            "Updated the layout of the landing page.",
            "Updated the navbar and footer for consistency.",
            "Added sections to show datasets and products on the landing page.",
            "Added a new landing page hero section.",
            "Fixed footer positioning so it stays at the bottom.",
            "Added a dedicated changelog page.",
            "Used different environment files for different setups.",
            "Added support for importing JSON into the dataset table.",
            "Fixed build errors related to dataset management.",
            "Added support for dropping datasets, databases, and collections.",
            "Improved handling of inserting and updating documents.",
            "Enabled document deletion in the dataset manager.",
            "Fixed an issue where dataset data was not updating correctly.",
            "Added numbered pagination for better navigation.",
            "Implemented pagination for datasets.",
            "Added a 'My Datasets' button to the navbar.",
            "Fixed issues with dataset creation.",
            "Updated the navbar links for easier navigation.",
            "Linked datasets to collections for better organization.",
            "Updated TypeScript configuration settings.",
            "Implemented data saving functionality in the dataset manager.",
            "Improved UI for the dataset manager by adding initial rows and columns.",
            "Enabled support for removing rows in data tables.",
            "Implemented a context menu for managing table rows and columns.",
            "Added an edit button to the dataset page.",
            "Added JSDoc comments for improved documentation.",
            "Refactored components for better organization."
        ]
    }
]
